SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
// ============================================================
//  Obiecte globale
// ============================================================
WiFiWebManager   wifiManager("ESP32_HAKit", "12345678");
DHT*             dht = nullptr;
// Aceeasi frecventa in timpul si dupa transfer evita recrearea repetata a
// handle-ului I2C in Arduino-ESP32 3.x.
Adafruit_SSD1306 oled(OLED_WIDTH, OLED_HEIGHT, &Wire, OLED_RESET,
                     OLED_I2C_FREQ, OLED_I2C_FREQ);
WiFiClient       wifiClient;
PubSubClient     mqttClient(wifiClient);
HardwareConfigStore hardwareStore;
HardwareConfig      g_hardware;

static bool g_oledReady = false;
static bool g_oledFailureReported = false;
static bool g_mdnsReady = false;
static bool g_spiffsReady = false;
static unsigned long g_restartAt = 0;
static File g_spiffsUploadFile;
static String g_spiffsUploadPath;
static String g_spiffsUploadError;
static size_t g_spiffsUploadBytes = 0;
static bool g_spiffsUploadStarted = false;

static const char* RESET_LOG_PATH = "/reset-log.txt";
static const char* LAST_COREDUMP_PATH = "/last-coredump.bin";
static const size_t RESET_LOG_MAX_SIZE = 64 * 1024;

#if defined(RGB_BUILTIN)
static constexpr bool RGB_LED_SUPPORTED = true;
#else
static constexpr bool RGB_LED_SUPPORTED = false;
#endif

static bool g_rgbLedOn = false;
static uint8_t g_rgbLedRed = 0;
static uint8_t g_rgbLedGreen = 128;
static uint8_t g_rgbLedBlue = 255;
static uint8_t g_rgbLedBrightness = 25;

// ============================================================
//  Variabile partajate (protejate de mutex intre task-uri)
// ============================================================
volatile float g_temperature    = NAN;
volatile float g_humidity       = NAN;
volatile bool  g_dhtPresent     = false;
volatile bool  g_motionDetected = false;
volatile bool  g_relayActive    = false;

// Accesat doar din loop() (core 1 - Arduino loop task)
static bool g_mqttConnected      = false;
static bool g_discoveryPublished = false;

// Mutex FreeRTOS pentru date partajate intre task-uri
// (portENTER_CRITICAL dezactiveaza intreruperile -> provoaca Interrupt WDT)
SemaphoreHandle_t g_mutex = nullptr;

// ============================================================
//  Control releu
// ============================================================
void setRelay(bool active)
{
  if (g_hardware.relayPin == PIN_DISABLED) return;

  const uint8_t activeLevel = g_hardware.relayActiveLow ? LOW : HIGH;
  digitalWrite(g_hardware.relayPin, active ? activeLevel : !activeLevel);

  xSemaphoreTake(g_mutex, portMAX_DELAY);
  g_relayActive = active;
  xSemaphoreGive(g_mutex);

  if (mqttClient.connected())
    mqttClient.publish(TOPIC_RELAY_STATE, active ? "ON" : "OFF", /*retain=*/true);
}

const char* resetReasonName(esp_reset_reason_t reason)
{
  switch (reason)
  {
    case ESP_RST_POWERON:    return "Power On";
    case ESP_RST_EXT:        return "External Pin";
    case ESP_RST_SW:         return "Software Reset";
    case ESP_RST_PANIC:      return "Exception/Panic";
    case ESP_RST_INT_WDT:    return "Interrupt Watchdog";
    case ESP_RST_TASK_WDT:   return "Task Watchdog";
    case ESP_RST_WDT:        return "Other Watchdog";
    case ESP_RST_DEEPSLEEP:  return "Deep Sleep";
    case ESP_RST_BROWNOUT:   return "Brownout";
    case ESP_RST_SDIO:       return "SDIO";
    case ESP_RST_USB:        return "USB";
    case ESP_RST_JTAG:       return "JTAG";
    case ESP_RST_EFUSE:      return "eFuse Error";
    case ESP_RST_PWR_GLITCH: return "Power Glitch";
    case ESP_RST_CPU_LOCKUP: return "CPU Lockup";
    default:                 return "Unknown";
  }
}

bool copyLastCoreDump(size_t imageAddress, size_t imageSize)
{
  const esp_partition_t* partition =
    esp_partition_find_first(ESP_PARTITION_TYPE_DATA,
                             ESP_PARTITION_SUBTYPE_DATA_COREDUMP, nullptr);
  if (!partition || imageAddress < partition->address ||
      imageAddress - partition->address + imageSize > partition->size)
    return false;

  File output = SPIFFS.open(LAST_COREDUMP_PATH, FILE_WRITE);
  if (!output) return false;

  uint8_t buffer[512];
  size_t copied = 0;
  const size_t partitionOffset = imageAddress - partition->address;
  while (copied < imageSize)
  {
    const size_t chunk = min(sizeof(buffer), imageSize - copied);
    if (esp_partition_read(partition, partitionOffset + copied, buffer, chunk) != ESP_OK ||
        output.write(buffer, chunk) != chunk)
    {
      output.close();
      SPIFFS.remove(LAST_COREDUMP_PATH);
      return false;
    }
    copied += chunk;
  }

  output.close();
  return true;
}

void writeCoreDumpSummary(File& logFile, bool& coreDumpCopied)
{
  size_t imageAddress = 0;
  size_t imageSize = 0;
  const esp_err_t imageResult = esp_core_dump_image_get(&imageAddress, &imageSize);
  if (imageResult != ESP_OK)
  {
    logFile.println(F("Coredump: indisponibil"));
    return;
  }

  logFile.printf("Coredump: prezent, %u bytes, flash=0x%08lx\n",
                 static_cast<unsigned>(imageSize),
                 static_cast<unsigned long>(imageAddress));
  logFile.printf("Coredump integritate: %s\n",
                 esp_err_to_name(esp_core_dump_image_check()));

#if CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH && CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF
  char panicReason[256] = {};
  if (esp_core_dump_get_panic_reason(panicReason, sizeof(panicReason)) == ESP_OK)
    logFile.printf("Panic reason: %s\n", panicReason);

  esp_core_dump_summary_t* summary =
    static_cast<esp_core_dump_summary_t*>(malloc(sizeof(esp_core_dump_summary_t)));
  if (summary && esp_core_dump_get_summary(summary) == ESP_OK)
  {
    logFile.printf("Task: %s | TCB=0x%08lx | PC=0x%08lx\n",
                   summary->exc_task,
                   static_cast<unsigned long>(summary->exc_tcb),
                   static_cast<unsigned long>(summary->exc_pc));
    logFile.printf("Coredump version: 0x%08lx | App ELF SHA256: %s\n",
                   static_cast<unsigned long>(summary->core_dump_version),
                   reinterpret_cast<const char*>(summary->app_elf_sha256));

#if CONFIG_IDF_TARGET_ARCH_XTENSA
    logFile.printf("EXCCAUSE=0x%08lx EXCVADDR=0x%08lx\n",
                   static_cast<unsigned long>(summary->ex_info.exc_cause),
                   static_cast<unsigned long>(summary->ex_info.exc_vaddr));
    for (size_t i = 0; i < 16; ++i)
    {
      logFile.printf("A%u=0x%08lx%s", static_cast<unsigned>(i),
                     static_cast<unsigned long>(summary->ex_info.exc_a[i]),
                     (i % 4 == 3) ? "\n" : " ");
    }
    logFile.print(F("Backtrace PC:"));
    for (size_t i = 0; i < summary->exc_bt_info.depth &&
                       i < sizeof(summary->exc_bt_info.bt) / sizeof(summary->exc_bt_info.bt[0]);
         ++i)
      logFile.printf(" 0x%08lx",
                     static_cast<unsigned long>(summary->exc_bt_info.bt[i]));
    logFile.printf("\nBacktrace corupt: %s\n",
                   summary->exc_bt_info.corrupted ? "da" : "nu");
#elif CONFIG_IDF_TARGET_ARCH_RISCV
    logFile.printf("MCAUSE=0x%08lx MTVAL=0x%08lx MSTATUS=0x%08lx MTVEC=0x%08lx\n",
                   static_cast<unsigned long>(summary->ex_info.mcause),
                   static_cast<unsigned long>(summary->ex_info.mtval),
                   static_cast<unsigned long>(summary->ex_info.mstatus),
                   static_cast<unsigned long>(summary->ex_info.mtvec));
    logFile.printf("RA=0x%08lx SP=0x%08lx\n",
                   static_cast<unsigned long>(summary->ex_info.ra),
                   static_cast<unsigned long>(summary->ex_info.sp));
    for (size_t i = 0; i < 8; ++i)
    {
      logFile.printf("A%u=0x%08lx%s", static_cast<unsigned>(i),
                     static_cast<unsigned long>(summary->ex_info.exc_a[i]),
                     (i % 4 == 3) ? "\n" : " ");
    }
    logFile.printf("Stack dump disponibil: %u bytes\n",
                   static_cast<unsigned>(summary->exc_bt_info.dump_size));
#endif
  }
  else
  {
    logFile.println(F("Rezumat coredump: nu a putut fi citit"));
  }
  free(summary);
#endif

  coreDumpCopied = copyLastCoreDump(imageAddress, imageSize);
  logFile.printf("Coredump brut: %s%s\n",
                 coreDumpCopied ? "salvat in " : "copiere esuata pentru ",
                 LAST_COREDUMP_PATH);
}

void persistResetLog()
{
  if (!g_spiffsReady) return;

  Preferences resetPrefs;
  uint32_t bootSequence = 1;
  if (resetPrefs.begin("reset_log", false))
  {
    bootSequence = resetPrefs.getUInt("sequence", 0) + 1;
    resetPrefs.putUInt("sequence", bootSequence);
    resetPrefs.end();
  }

