SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
  File existing = SPIFFS.open(RESET_LOG_PATH, FILE_READ);
  const bool rotateLog = existing && existing.size() >= RESET_LOG_MAX_SIZE;
  if (existing) existing.close();
  if (rotateLog) SPIFFS.remove(RESET_LOG_PATH);

  File logFile = SPIFFS.open(RESET_LOG_PATH, FILE_APPEND);
  if (!logFile)
  {
    serialLog.println("[ResetLog] Nu pot deschide /reset-log.txt");
    return;
  }

  const esp_reset_reason_t reason = esp_reset_reason();
  logFile.println(F("============================================================"));
  logFile.printf("Boot #%lu | reset=%s (%d)\n",
                 static_cast<unsigned long>(bootSequence),
                 resetReasonName(reason), static_cast<int>(reason));
  logFile.printf("Chip=%s | profil=%s | SDK=%s\n",
                 ESP.getChipModel(), buildProfileName(), ESP.getSdkVersion());
  logFile.printf("Firmware MD5=%s | sketch=%u bytes | flash=%u bytes\n",
                 ESP.getSketchMD5().c_str(),
                 static_cast<unsigned>(ESP.getSketchSize()),
                 static_cast<unsigned>(ESP.getFlashChipSize()));

  bool coreDumpCopied = false;
  writeCoreDumpSummary(logFile, coreDumpCopied);
  logFile.println();
  logFile.close();

  if (coreDumpCopied)
  {
    const esp_err_t eraseResult = esp_core_dump_image_erase();
    if (eraseResult != ESP_OK)
      serialLog.printf("[ResetLog] Coredump copiat, dar stergerea a esuat: %s\n",
                       esp_err_to_name(eraseResult));
  }

  serialLog.printf("[ResetLog] Boot #%lu salvat in %s (%s)\n",
                   static_cast<unsigned long>(bootSequence), RESET_LOG_PATH,
                   resetReasonName(reason));
}

// ============================================================
//  Control LED RGB onboard
// ============================================================
void applyRgbLed()
{
#if defined(RGB_BUILTIN)
  if (!g_rgbLedOn)
  {
    rgbLedWrite(RGB_BUILTIN, 0, 0, 0);
    return;
  }

  const uint8_t red = static_cast<uint8_t>(
    (static_cast<uint16_t>(g_rgbLedRed) * g_rgbLedBrightness) / 100);
  const uint8_t green = static_cast<uint8_t>(
    (static_cast<uint16_t>(g_rgbLedGreen) * g_rgbLedBrightness) / 100);
  const uint8_t blue = static_cast<uint8_t>(
    (static_cast<uint16_t>(g_rgbLedBlue) * g_rgbLedBrightness) / 100);
  rgbLedWrite(RGB_BUILTIN, red, green, blue);
#endif
}

String rgbLedStateJson()
{
  String json;
  json.reserve(120);
  json = F("{\"supported\":");
  json += RGB_LED_SUPPORTED ? F("true") : F("false");
  json += F(",\"on\":");
  json += g_rgbLedOn ? F("true") : F("false");
  json += F(",\"red\":");
  json += g_rgbLedRed;
  json += F(",\"green\":");
  json += g_rgbLedGreen;
  json += F(",\"blue\":");
  json += g_rgbLedBlue;
  json += F(",\"brightness\":");
  json += g_rgbLedBrightness;
#if defined(PIN_RGB_LED)
  json += F(",\"pin\":");
  json += PIN_RGB_LED;
#else
  json += F(",\"pin\":-1");
#endif
  json += '}';
  return json;
}

// ============================================================
//  OLED helpers  (apelat doar din loop() - Wire-safe pe core 1)
// ============================================================
bool isI2cDevicePresent(uint8_t address)
{
  Wire.beginTransmission(address);
  return Wire.endTransmission(true) == 0;
}

void disableOled(const __FlashStringHelper* reason)
{
  g_oledReady = false;
  if (!g_oledFailureReported)
  {
    serialLog.print(F("[OLED] Dezactivat: "));
    serialLog.println(reason);
    g_oledFailureReported = true;
  }
}

void oledDrawStatus()
{
  if (!g_oledReady) return;
  if (!isI2cDevicePresent(g_hardware.oledAddress))
  {
    disableOled(F("display-ul nu mai raspunde pe magistrala I2C"));
    return;
  }

  float temp, hum;
  bool  motion, relay;

  xSemaphoreTake(g_mutex, portMAX_DELAY);
  temp   = g_temperature;
  hum    = g_humidity;
  motion = g_motionDetected;
  relay  = g_relayActive;
  xSemaphoreGive(g_mutex);

  oled.clearDisplay();
  oled.setTextColor(SSD1306_WHITE);
  oled.setTextSize(1);

  // Titlu
  oled.setCursor(22, 0);
  oled.print(F("ESP32 HA Kit"));
  oled.drawLine(0, 9, OLED_WIDTH - 1, 9, SSD1306_WHITE);

  // Temperatura
  oled.setCursor(0, 13);
  oled.print(F("Temp:  "));
  if (!isnan(temp)) { oled.print(temp, 1); oled.print(F(" C")); }
  else               oled.print(F("--.-"));

  // Umiditate
  oled.setCursor(0, 24);
  oled.print(F("Umid:  "));
  if (!isnan(hum)) { oled.print(hum, 1); oled.print(F(" %")); }
  else              oled.print(F("--.-"));

  // Miscare PIR
  oled.setCursor(0, 35);
  oled.print(F("Miscare: "));
  if (motion)
  {
    oled.fillRect(68, 33, 58, 11, SSD1306_WHITE);
    oled.setTextColor(SSD1306_BLACK);
    oled.setCursor(70, 35);
    oled.print(F("DETECTAT"));
    oled.setTextColor(SSD1306_WHITE);
  }
  else
  {
    oled.print(F("Nu"));
  }

  // Releu
  oled.setCursor(0, 46);
  oled.print(F("Releu:   "));
  oled.print(relay ? F("ON ") : F("OFF"));

  // Bara status
  oled.drawLine(0, 54, OLED_WIDTH - 1, 54, SSD1306_WHITE);
  oled.setCursor(0, 56);
  if (wifiManager.isConnected())
  {
    String ip = wifiManager.getIPAddress();
    int dot1  = ip.indexOf('.', ip.indexOf('.') + 1);
    oled.print(ip.substring(dot1 + 1));         // ultimii 2 octeti
    oled.print(g_mqttConnected ? F(" MQTT:OK") : F(" MQTT:--"));
  }
  else
  {
    oled.print(F("AP: ESP32_HAKit"));
  }

  oled.display();
}

// ============================================================
//  FreeRTOS Tasks
// ============================================================
void taskSensors(void* parameter)
{
  (void)parameter;

  unsigned long lastDhtRead = 0;
  uint8_t consecutiveDhtFailures = 0;

  while (true)
  {
    unsigned long now = millis();

    // DHT11: citire la fiecare 2 secunde (max 1 citire/sec conform datasheet)
    if (dht != nullptr && now - lastDhtRead >= 2000)
    {
      lastDhtRead = now;
      float t = dht->readTemperature();
      float h = dht->readHumidity();

      if (!isnan(t) && !isnan(h))
      {
        consecutiveDhtFailures = 0;
        xSemaphoreTake(g_mutex, portMAX_DELAY);
        g_temperature = t;
        g_humidity    = h;
        g_dhtPresent  = true;
        xSemaphoreGive(g_mutex);
      }
      else if (++consecutiveDhtFailures >= 3)
      {
        xSemaphoreTake(g_mutex, portMAX_DELAY);
        g_temperature = NAN;
        g_humidity    = NAN;
        g_dhtPresent  = false;
        xSemaphoreGive(g_mutex);
      }
    }

    // PIR HC-SR501: citire continua (HIGH = miscare detectata)
    if (g_hardware.pirPin != PIN_DISABLED)
    {
      bool motion = (digitalRead(g_hardware.pirPin) == HIGH);
      xSemaphoreTake(g_mutex, portMAX_DELAY);
      g_motionDetected = motion;
      xSemaphoreGive(g_mutex);
    }

    vTaskDelay(pdMS_TO_TICKS(100));
  }
}

void taskHeartbeat(void* parameter)
{
  (void)parameter;

  bool state = false;
  while (true)
  {
    state = !state;
    digitalWrite(g_hardware.heartbeatPin, state ? HIGH : LOW);
    vTaskDelay(pdMS_TO_TICKS(500));
  }
}

