SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
// ============================================================
//  MQTT
// ============================================================
void mqttCallback(char* topic, byte* payload, unsigned int length)
{
  String msg;
  for (unsigned int i = 0; i < length; ++i)
    msg += static_cast<char>(payload[i]);

  if (String(topic) == String(TOPIC_RELAY_CMD))
  {
    if      (msg == "ON")  setRelay(true);
    else if (msg == "OFF") setRelay(false);
  }
}

void publishDiscovery()
{
  // Bloc device comun (inclus in fiecare config)
  const String dev =
    "\"device\":{"
    "\"identifiers\":[\"esp32kit\"],"
    "\"name\":\"ESP32 HA Kit\","
    "\"model\":\"" + String(ESP.getChipModel()) + "\","
    "\"manufacturer\":\"Espressif Systems\","
    "\"sw_version\":\"1.0.0\""
    "}";

  // Temperatura si umiditate
  if (g_hardware.dhtPin != PIN_DISABLED)
  {
    String cfg = "{\"name\":\"Temperatura\","
                 "\"device_class\":\"temperature\","
                 "\"unit_of_measurement\":\"\xC2\xB0" "C\","
                 "\"state_topic\":\"" + String(TOPIC_STATE) + "\","
                 "\"value_template\":\"{{ value_json.temperature | round(1) }}\","
                 "\"unique_id\":\"esp32kit_temperature\","
                 + dev + "}";
    mqttClient.publish(DISC_TEMP, cfg.c_str(), true);

    cfg = "{\"name\":\"Umiditate\","
          "\"device_class\":\"humidity\","
          "\"unit_of_measurement\":\"%\","
          "\"state_topic\":\"" + String(TOPIC_STATE) + "\","
          "\"value_template\":\"{{ value_json.humidity | round(1) }}\","
          "\"unique_id\":\"esp32kit_humidity\","
          + dev + "}";
    mqttClient.publish(DISC_HUM, cfg.c_str(), true);
  }
  else
  {
    mqttClient.publish(DISC_TEMP, "", true);
    mqttClient.publish(DISC_HUM, "", true);
  }

  // Senzor PIR miscare
  if (g_hardware.pirPin != PIN_DISABLED)
  {
    String cfg = "{\"name\":\"Miscare\","
                 "\"device_class\":\"motion\","
                 "\"state_topic\":\"" + String(TOPIC_STATE) + "\","
                 "\"value_template\":\"{{ value_json.motion }}\","
                 "\"payload_on\":\"true\","
                 "\"payload_off\":\"false\","
                 "\"unique_id\":\"esp32kit_motion\","
                 + dev + "}";
    mqttClient.publish(DISC_MOTION, cfg.c_str(), true);
  }
  else
  {
    mqttClient.publish(DISC_MOTION, "", true);
  }

  // Releu switch
  if (g_hardware.relayPin != PIN_DISABLED)
  {
    String cfg = "{\"name\":\"Releu\","
                 "\"state_topic\":\"" + String(TOPIC_RELAY_STATE) + "\","
                 "\"command_topic\":\"" + String(TOPIC_RELAY_CMD) + "\","
                 "\"payload_on\":\"ON\","
                 "\"payload_off\":\"OFF\","
                 "\"unique_id\":\"esp32kit_relay\","
                 + dev + "}";
    mqttClient.publish(DISC_RELAY, cfg.c_str(), true);
  }
  else
  {
    mqttClient.publish(DISC_RELAY, "", true);
  }

  g_discoveryPublished = true;
  serialLog.println("[MQTT] Home Assistant discovery publicat");
}

bool mqttReconnect()
{
  mqttClient.setServer(g_mqttBroker.c_str(), g_mqttPort);
  serialLog.printf("[MQTT] Conectare la %s:%d ...\n", g_mqttBroker.c_str(), g_mqttPort);

  bool ok = (g_mqttUser.length() > 0)
    ? mqttClient.connect(g_mqttClientId.c_str(), g_mqttUser.c_str(), g_mqttPass.c_str())
    : mqttClient.connect(g_mqttClientId.c_str());

  if (ok)
  {
    serialLog.println("[MQTT] Conectat!");
    mqttClient.subscribe(TOPIC_RELAY_CMD);
    g_mqttConnected      = true;
    g_discoveryPublished = false;   // re-publica discovery dupa reconectare
  }
  else
  {
    serialLog.printf("[MQTT] Esuat (rc=%d) broker=%s:%d\n", mqttClient.state(), g_mqttBroker.c_str(), g_mqttPort);
    g_mqttConnected = false;
  }
  return ok;
}

void handleMqtt()
{
  if (!wifiManager.isConnected()) return;

  if (!mqttClient.connected())
  {
    static unsigned long lastAttempt = 0;
    if (millis() - lastAttempt >= 5000)
    {
      lastAttempt = millis();
      g_mqttConnected = false;
      mqttReconnect();
    }
    return;
  }

  mqttClient.loop();

  if (!g_discoveryPublished)
    publishDiscovery();
}

void publishState()
{
  if (!mqttClient.connected()) return;

  float temp, hum;
  bool  motion, relay;

  xSemaphoreTake(g_mutex, portMAX_DELAY);
  temp   = g_temperature;
  hum    = g_humidity;
  motion = g_motionDetected;
  relay  = g_relayActive;
  xSemaphoreGive(g_mutex);

  String json = "{";
  json += "\"temperature\":";
  json += isnan(temp) ? "null" : String(temp, 1);
  json += ",\"humidity\":";
  json += isnan(hum)  ? "null" : String(hum, 1);
  json += ",\"motion\":";
  json += motion ? "true" : "false";
  json += ",\"relay\":";
  json += relay  ? "true" : "false";
  json += ",\"uptime\":";
  json += String(millis() / 1000);
  json += "}";

  mqttClient.publish(TOPIC_STATE, json.c_str());
  mqttClient.publish(TOPIC_RELAY_STATE, relay ? "ON" : "OFF", true);
}

// ============================================================
//  Web Server Handlers
// ============================================================
void handleRoot(WebServer& server)
{
  server.send_P(200, "text/html", htmlPage);
}

String jsonEscape(const String& value)
{
  String escaped;
  escaped.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); ++i)
  {
    const char c = value[i];
    switch (c)
    {
      case '"':  escaped += F("\\\""); break;
      case '\\': escaped += F("\\\\"); break;
      case '\b': escaped += F("\\b"); break;
      case '\f': escaped += F("\\f"); break;
      case '\n': escaped += F("\\n"); break;
      case '\r': escaped += F("\\r"); break;
      case '\t': escaped += F("\\t"); break;
      default:
        if (static_cast<uint8_t>(c) >= 0x20) escaped += c;
        break;
    }
  }
  return escaped;
}

bool isValidSpiffsPath(const String& path)
{
  if (path.length() < 2 || path.length() > 128 || path[0] != '/') return false;
  if (path.indexOf(F("..")) >= 0 || path.indexOf('\\') >= 0) return false;

  for (size_t i = 0; i < path.length(); ++i)
  {
    if (static_cast<uint8_t>(path[i]) < 0x20) return false;
  }
  return true;
}

String safeSpiffsUploadPath(const String& filename)
{
  int separator = filename.lastIndexOf('/');
  const int backslash = filename.lastIndexOf('\\');
  if (backslash > separator) separator = backslash;

  String basename = filename.substring(separator + 1);
  basename.trim();
  if (basename.length() == 0 || basename == "." || basename == "..") return "";

  String safeName;
  safeName.reserve(min(static_cast<size_t>(64), basename.length()) + 1);
  for (size_t i = 0; i < basename.length() && safeName.length() < 64; ++i)
  {
    const char c = basename[i];
    safeName += isAlphaNumeric(c) || c == '.' || c == '-' || c == '_' ? c : '_';
  }
  if (safeName.length() == 0 || safeName == "." || safeName == "..") return "";
  return "/" + safeName;
}

