SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
String safeDownloadFilename(const String& path)
{
  String filename = path.substring(path.lastIndexOf('/') + 1);
  String safeName;
  safeName.reserve(filename.length());
  for (size_t i = 0; i < filename.length(); ++i)
  {
    const char c = filename[i];
    safeName += isAlphaNumeric(c) || c == '.' || c == '-' || c == '_' ? c : '_';
  }
  return safeName.length() ? safeName : "download.bin";
}

void handleSpiffsList(WebServer& server)
{
  server.sendHeader("Cache-Control", "no-store");
  if (!g_spiffsReady)
  {
    server.send(503, "application/json",
                "{\"mounted\":false,\"error\":\"SPIFFS nu este disponibil\"}");
    return;
  }

  File root = SPIFFS.open("/");
  if (!root || !root.isDirectory())
  {
    server.send(500, "application/json",
                "{\"mounted\":true,\"error\":\"directorul SPIFFS nu poate fi citit\"}");
    return;
  }

  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "application/json", "");
  server.sendContent(String(F("{\"mounted\":true,\"total\":")) +
                     SPIFFS.totalBytes() + F(",\"used\":") +
                     SPIFFS.usedBytes() + F(",\"files\":["));

  bool first = true;
  File file = root.openNextFile();
  while (file)
  {
    if (!file.isDirectory())
    {
      String fileName = file.name();
      if (!fileName.startsWith("/")) fileName = "/" + fileName;
      String entry;
      entry.reserve(fileName.length() + 40);
      if (!first) entry += ',';
      entry += F("{\"name\":\"");
      entry += jsonEscape(fileName);
      entry += F("\",\"size\":");
      entry += file.size();
      entry += '}';
      server.sendContent(entry);
      first = false;
    }
    file = root.openNextFile();
  }
  server.sendContent("]}");
  server.sendContent("");
}

void handleSpiffsDownload(WebServer& server)
{
  if (!g_spiffsReady)
  {
    server.send(503, "application/json", "{\"error\":\"SPIFFS nu este disponibil\"}");
    return;
  }

  const String path = server.arg("path");
  if (!isValidSpiffsPath(path))
  {
    server.send(400, "application/json", "{\"error\":\"cale SPIFFS invalida\"}");
    return;
  }

  File file = SPIFFS.open(path, FILE_READ);
  if (!file || file.isDirectory())
  {
    server.send(404, "application/json", "{\"error\":\"fisierul nu exista\"}");
    return;
  }

  server.sendHeader("Cache-Control", "no-store");
  server.sendHeader("Content-Disposition",
                    "attachment; filename=\"" + safeDownloadFilename(path) + "\"");
  server.streamFile(file, "application/octet-stream");
  file.close();
}

void handleSpiffsUploadData()
{
  WebServer& server = wifiManager.getServer();
  HTTPUpload& upload = server.upload();

  if (upload.status == UPLOAD_FILE_START)
  {
    if (g_spiffsUploadFile) g_spiffsUploadFile.close();
    g_spiffsUploadPath = "";
    g_spiffsUploadError = "";
    g_spiffsUploadBytes = 0;
    g_spiffsUploadStarted = true;

    if (!g_spiffsReady)
    {
      g_spiffsUploadError = F("SPIFFS nu este disponibil");
      return;
    }

    g_spiffsUploadPath = safeSpiffsUploadPath(upload.filename);
    if (g_spiffsUploadPath.length() == 0)
    {
      g_spiffsUploadError = F("nume de fisier invalid");
      return;
    }

    g_spiffsUploadFile = SPIFFS.open(g_spiffsUploadPath, FILE_WRITE);
    if (!g_spiffsUploadFile)
    {
      g_spiffsUploadError = F("fisierul nu poate fi creat");
      return;
    }
    serialLog.println("[SPIFFS] Upload inceput: " + g_spiffsUploadPath);
  }
  else if (upload.status == UPLOAD_FILE_WRITE)
  {
    if (g_spiffsUploadError.length() == 0 && g_spiffsUploadFile)
    {
      const size_t written = g_spiffsUploadFile.write(upload.buf, upload.currentSize);
      g_spiffsUploadBytes += written;
      if (written != upload.currentSize)
      {
        g_spiffsUploadError = F("spatiu insuficient sau eroare la scriere");
        g_spiffsUploadFile.close();
        SPIFFS.remove(g_spiffsUploadPath);
      }
    }
  }
  else if (upload.status == UPLOAD_FILE_END)
  {
    if (g_spiffsUploadFile) g_spiffsUploadFile.close();
    if (g_spiffsUploadError.length() == 0)
      serialLog.printf("[SPIFFS] Upload finalizat: %s (%u bytes)\n",
                       g_spiffsUploadPath.c_str(),
                       static_cast<unsigned>(g_spiffsUploadBytes));
    else if (g_spiffsUploadPath.length())
      SPIFFS.remove(g_spiffsUploadPath);
  }
  else if (upload.status == UPLOAD_FILE_ABORTED)
  {
    if (g_spiffsUploadFile) g_spiffsUploadFile.close();
    if (g_spiffsUploadPath.length()) SPIFFS.remove(g_spiffsUploadPath);
    g_spiffsUploadError = F("upload intrerupt");
  }
}

void handleSpiffsUploadComplete()
{
  WebServer& server = wifiManager.getServer();
  server.sendHeader("Cache-Control", "no-store");

  if (!g_spiffsUploadStarted)
  {
    server.send(400, "application/json",
                "{\"ok\":false,\"error\":\"nu a fost primit niciun fisier\"}");
    return;
  }
  g_spiffsUploadStarted = false;

  if (g_spiffsUploadError.length())
  {
    String response = F("{\"ok\":false,\"error\":\"");
    response += jsonEscape(g_spiffsUploadError);
    response += F("\"}");
    server.send(g_spiffsReady ? 500 : 503, "application/json", response);
    return;
  }

  if (g_spiffsUploadPath.length() == 0)
  {
    server.send(400, "application/json",
                "{\"ok\":false,\"error\":\"nu a fost primit niciun fisier\"}");
    return;
  }

  String response = F("{\"ok\":true,\"name\":\"");
  response += jsonEscape(g_spiffsUploadPath);
  response += F("\",\"size\":");
  response += g_spiffsUploadBytes;
  response += '}';
  server.send(201, "application/json", response);
}

void handleUiConfigGet(WebServer& server)
{
  server.sendHeader("Cache-Control", "no-store");
  server.send(200, "application/json",
              String(F("{\"language\":\"")) + g_uiLanguage + F("\"}"));
}

void handleUiConfigPost(WebServer& server)
{
  const String language = server.arg("language");
  if (language != "ro" && language != "en")
  {
    server.send(400, "application/json",
                "{\"ok\":false,\"error\":\"language must be ro or en\"}");
    return;
  }
  if (!saveUiLanguage(language))
  {
    server.send(500, "application/json",
                "{\"ok\":false,\"error\":\"failed to save language\"}");
    return;
  }
  server.send(200, "application/json",
              String(F("{\"ok\":true,\"language\":\"")) + g_uiLanguage + F("\"}"));
}

