SimedruF/ESP32-MQTT-Home-Assistant-DIY-Kit/src/main.cpp
  for (size_t i = 0; i < value.length(); ++i)
  {
    if (!isDigit(value[i]))
    {
      ok = false;
      return PIN_DISABLED;
    }
  }

  long pin = value.toInt();
  ok = pin >= 0 && pin <= 127;
  return static_cast<int>(pin);
}

void scheduleRestart()
{
  g_restartAt = millis() + 1500;
}

void handleHardwareConfigGet(WebServer& server)
{
  String json = hardwareConfigToJson(g_hardware);
  json.remove(json.length() - 1);
  json += F(",\"pins\":");
  json += gpioInventoryToJson(g_hardware);
  json += '}';
  server.send(200, "application/json", json);
}

void handleHardwareConfigPost(WebServer& server)
{
  bool ok = true;
  HardwareConfig config = g_hardware;
  config.dhtPin = parsePinArgument(server, "dht_pin", ok);
  if (!ok) { server.send(400, "application/json", "{\"ok\":false,\"error\":\"dht_pin invalid\"}"); return; }
  config.pirPin = parsePinArgument(server, "pir_pin", ok);
  if (!ok) { server.send(400, "application/json", "{\"ok\":false,\"error\":\"pir_pin invalid\"}"); return; }
  config.relayPin = parsePinArgument(server, "relay_pin", ok);
  if (!ok) { server.send(400, "application/json", "{\"ok\":false,\"error\":\"relay_pin invalid\"}"); return; }
  config.heartbeatPin = parsePinArgument(server, "heartbeat_pin", ok);
  if (!ok) { server.send(400, "application/json", "{\"ok\":false,\"error\":\"heartbeat_pin invalid\"}"); return; }
  config.sdaPin = parsePinArgument(server, "sda_pin", ok);
  if (!ok) { server.send(400, "application/json", "{\"ok\":false,\"error\":\"sda_pin invalid\"}"); return; }
  config.sclPin = parsePinArgument(server, "scl_pin", ok);
  if (!ok) { server.send(400, "application/json", "{\"ok\":false,\"error\":\"scl_pin invalid\"}"); return; }

  config.relayActiveLow = !server.hasArg("relay_active_low") ||
                          server.arg("relay_active_low") == "1" ||
                          server.arg("relay_active_low") == "true";

  int oledAddress = server.hasArg("oled_address") ? server.arg("oled_address").toInt() : 0x3C;
  config.oledAddress = static_cast<uint8_t>(oledAddress);

  String error;
  if (!validateHardwareConfig(config, error))
  {
    String response = F("{\"ok\":false,\"error\":\"");
    response += error;
    response += F("\"}");
    server.send(400, "application/json", response);
    return;
  }

  if (!hardwareStore.save(config))
  {
    server.send(500, "application/json", "{\"ok\":false,\"error\":\"scrierea in NVS a esuat\"}");
    return;
  }

  server.send(200, "application/json",
              "{\"ok\":true,\"message\":\"Configuratia a fost salvata. Dispozitivul reporneste.\"}");
  scheduleRestart();
}

void handleHardwareConfigReset(WebServer& server)
{
  hardwareStore.clear();
  server.send(200, "application/json",
              "{\"ok\":true,\"message\":\"Profilul implicit a fost restaurat. Dispozitivul reporneste.\"}");
  scheduleRestart();
}

// ============================================================
//  setup() & loop()
// ============================================================
void setup()
{
  // Creeaza mutex-ul inainte de orice altceva (inclusiv task-uri)
  g_mutex = xSemaphoreCreateMutex();

  Serial.begin(115200);
  serialLog.begin();
  delay(300);
  serialLog.println("\n=== ESP32 MQTT Home Assistant DIY Kit ===");

#if defined(ZIGBEE_COPROCESSOR_POWER_PIN)
  pinMode(ZIGBEE_COPROCESSOR_POWER_PIN, OUTPUT);
  digitalWrite(ZIGBEE_COPROCESSOR_POWER_PIN, HIGH);
  serialLog.printf("[Zigbee] TLSR8258 alimentat prin GPIO%d; HCI nu este activ in acest firmware\n",
                   ZIGBEE_COPROCESSOR_POWER_PIN);
#endif

  loadUiConfig();
  loadCommunicationConfig();
  g_hardware = hardwareStore.load();
  serialLog.println("[HW] Target: " + String(targetName()) + " / profil: " + buildProfileName());

  applyRgbLed();
#if defined(PIN_RGB_LED)
  serialLog.printf("[RGB] LED onboard disponibil pe GPIO%d\n", PIN_RGB_LED);
#else
  serialLog.println("[RGB] LED onboard indisponibil pentru acest profil");
#endif

  if (g_hardware.pirPin != PIN_DISABLED)
    pinMode(g_hardware.pirPin, INPUT);

  if (g_hardware.relayPin != PIN_DISABLED)
  {
    pinMode(g_hardware.relayPin, OUTPUT);
    const uint8_t activeLevel = g_hardware.relayActiveLow ? LOW : HIGH;
    digitalWrite(g_hardware.relayPin, !activeLevel);
  }

  if (g_hardware.heartbeatPin != PIN_DISABLED)
  {
    pinMode(g_hardware.heartbeatPin, OUTPUT);
    digitalWrite(g_hardware.heartbeatPin, LOW);
  }

  // DHT11
  if (g_hardware.dhtPin != PIN_DISABLED)
  {
    dht = new DHT(g_hardware.dhtPin, DHT_TYPE);
    dht->begin();
    serialLog.println("[DHT11] Initializat pe GPIO" + String(g_hardware.dhtPin));
  }
  else
  {
    serialLog.println("[DHT11] Dezactivat");
  }

  // OLED SSD1306 (Wire este folosit doar din loop)
  if (g_hardware.sdaPin != PIN_DISABLED && g_hardware.sclPin != PIN_DISABLED)
  {
    Wire.setTimeOut(25);
    bool wireReady = Wire.begin(g_hardware.sdaPin, g_hardware.sclPin, OLED_I2C_FREQ);
    if (!wireReady)
    {
      disableOled(F("initializarea magistralei I2C a esuat"));
    }
    else if (!isI2cDevicePresent(g_hardware.oledAddress))
    {
      disableOled(F("adresa configurata nu raspunde; verifica SDA, SCL si 0x3C/0x3D"));
    }
    else
    {
      // Wire a fost deja initializat cu pinii configurati; periphBegin=false.
      g_oledReady = oled.begin(SSD1306_SWITCHCAPVCC, g_hardware.oledAddress,
                               true, false);
    }

    if (!g_oledReady && !g_oledFailureReported)
    {
      disableOled(F("initializarea controlerului SSD1306 a esuat"));
    }
    else if (g_oledReady)
    {
      oled.clearDisplay();
      oled.setTextSize(1);
      oled.setTextColor(SSD1306_WHITE);
      oled.setCursor(16, 20);
      oled.print(F("ESP32 HA Kit"));
      oled.setCursor(10, 35);
      oled.print(F("Initializing..."));
      oled.display();
      serialLog.printf("[OLED] Initializat (0x%02X, SDA=GPIO%d, SCL=GPIO%d)\n",
                       g_hardware.oledAddress, g_hardware.sdaPin, g_hardware.sclPin);
    }
  }
  else
  {
    serialLog.println("[OLED] Dezactivat");
  }

  g_spiffsReady = SPIFFS.begin(true);
  if (g_spiffsReady)
  {
    serialLog.printf("[SPIFFS] Montat: %u / %u bytes folositi\n",
                     static_cast<unsigned>(SPIFFS.usedBytes()),
                     static_cast<unsigned>(SPIFFS.totalBytes()));
    persistResetLog();
  }
  else
  {
    serialLog.println("[SPIFFS] Montarea sau formatarea partitiei a esuat");
  }

  // WiFiWebManager
  wifiManager.begin();

